{
    "slug": "typescript-fundamentals-for-javascript-developers",
    "title": {
        "es": "Fundamentos de TypeScript con Práctica para Desarrolladores JavaScript",
        "en": "Fundamentals of TypeScript with Practice for JavaScript Developers"
    },
    "technologies": [
        "typescript",
        "javascript",
        "front-end"
    ],
    "difficulty": "beginner",
    "description": {
        "es": "Este curso está diseñado para estudiantes que dominan JavaScript moderno y han leído sobre TypeScript (básico y avanzado). Aprenderás conceptos clave como interfaces básicas, type aliases y propiedades opcionales, así como union types, tipos literales y cómo gestionar estados de aplicación. También explorarás genéricos simples, incluyendo ApiResponse<T> y funciones genéricas, para construir una base sólida en TypeScript. A través de lecciones teóricas, ejercicios prácticos de código y cuestionarios, este curso de nivel principiante te ayudará a aplicar TypeScript de manera efectiva en tus proyectos, mejorando la seguridad de tipos y la calidad del código en tan solo 60 minutos Ascendiendo a un nivel superior, este curso te permitirá dominar TypeScript y llevar tus habilidades de desarrollo web al siguiente nivel. ¡Todo en un entorno práctico y dinámico!",
        "en": "This course is designed for students who are proficient in modern JavaScript and have read about TypeScript (basic and advanced). You will learn key concepts such as basic interfaces, type aliases, and optional properties, as well as union types, literal types, and how to manage application states. You will also explore simple generics, including ApiResponse<T> and generic functions, to build a solid foundation in TypeScript. Through theoretical lessons, practical coding exercises, and quizzes, this beginner-level course will help you effectively apply TypeScript in your projects, improving type safety and code quality in just 60 minutes. Ascending to a higher level, this course will enable you to master TypeScript and take your web development skills to the next level. All in a practical and dynamic environment!"
    },
    "grading": "isolated",
    "telemetry": {
        "batch": "https://breathecode.herokuapp.com/v1/assignment/me/telemetry"
    },
    "preview": "https://typescript-fundamentals-for-javascript-developers.learn-pack.com/preview.png",
    "testingEnvironment": "cloud"
}
